In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\ghimi\anaconda3\lib\site-packages (8.4.0)

In [1]:
import mysql.connector
database = mysql.connector.connect(
   host="localhost",
   user="root",
   password="",
   database = "python_class_8_am")
db = database.cursor()

In [2]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
     print(x)

(100, 'Ram', 100, 100, 100, 100, 100, 100, 100.0, 'A+')
(200, 'Shyam', 99, 99, 99, 99, 99, 493, 99.98, 'A+')
(300, 'Hari', 98, 98, 98, 98, 98, 496, 98.0, 'A+')

In [3]:
sql = '''INSERT INTO student (`sn`,`name`, `physics`, `chemistry`, `math`, `english`,`nepali`, `total`, `per`, `grade`) 
VALUES ('22', 'Ifran Hizab', '98', '68', '94', '89', '78', '416', '83.45', 'A');'''

db.execute(sql)

database.commit()

print(db.rowcount, "record inserted.")

1 record inserted.

In [26]:
name = input("enter your name = ")
physics = int(input("enter the marks obtained in physics = "))
chemistry = int(input("enter the marks obtained in chemistry = "))
math = int(input("enter the marks obtained in maths = "))
english = int(input("enter the marks obtained in english = "))
nepali = int(input("enter the marks obtained in nepali = "))

total = physics + chemistry + math + english + nepali
per = total/5

if per >= 80:
   grade = "A"
elif per >= 60:
   grade = "B"
elif per >= 40:
   grade = "C"
else:
   grade = "NG"





sql = f'''INSERT INTO student (name, physics, chemistry, math, english,nepali, total, per, grade)
         VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}');'''

db.execute(sql)

database.commit()

print(db.rowcount, "record inserted.")

enter your name =  Zyana
enter the marks obtained in physics =  100
enter the marks obtained in chemistry =  100
enter the marks obtained in maths =  100
enter the marks obtained in english =  99
enter the marks obtained in nepali =  88

1 record inserted.

In [3]:
# update sql

In [5]:
sql = "UPDATE student SET name = 'Asmita Dhungana' WHERE sn = 22"

db.execute(sql)

database.commit()

print(db.rowcount, "record(s) affected")

1 record(s) affected

In [6]:
sql = "UPDATE student SET name = 'Ankita Dhital' WHERE sn = 22"

db.execute(sql)

database.commit()

print(db.rowcount, "record(s) affected")

1 record(s) affected

In [6]:
# delete in sql

In [7]:
sql = "DELETE FROM student WHERE sn = 22"
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) deleted")

1 record(s) deleted

In [8]:
# select

In [8]:
db.execute("SELECT * FROM student WHERE physics > 95")
result =db.fetchall()
for x in result:
    print(x)

(100, 'Ram', 100, 100, 100, 100, 100, 100, 100.0, 'A+')
(200, 'Shyam', 99, 99, 99, 99, 99, 493, 99.98, 'A+')
(300, 'Hari', 98, 98, 98, 98, 98, 496, 98.0, 'A+')
(301, 'Emran Khan', 97, 97, 97, 97, 97, 485, 97.0, 'A')

In [9]:
db.execute("SELECT * FROM student WHERE physics < 95")
result =db.fetchall()
for x in result:
    print(x)

In [13]:
db.execute("SELECT * FROM student WHERE name LIKE '%Ram%'")
result =db.fetchall()
for x in result:
     print(x)

(100, 'Ram', 100, 100, 100, 100, 100, 100, 100.0, 'A+')

In [14]:
db.execute("SELECT * FROM student WHERE name LIKE '%Ram%'")
result =db.fetchall()
for x in result:
     print(x)

(100, 'Ram', 100, 100, 100, 100, 100, 100, 100.0, 'A+')

In [15]:
db.execute("SELECT * FROM student WHERE physics < 99 and math > 59")
result =db.fetchall()
for x in result:
    print(x)

(300, 'Hari', 98, 98, 98, 98, 98, 496, 98.0, 'A+')
(301, 'Emran Khan', 97, 97, 97, 97, 97, 485, 97.0, 'A')

In [16]:
db.execute("SELECT name,total,per, grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

('Ram', 100, 100.0, 'A+')
('Shyam', 493, 99.98, 'A+')
('Hari', 496, 98.0, 'A+')
('Emran Khan', 485, 97.0, 'A')

In [17]:
db.execute("SELECT * FROM student ORDER BY total")
result =db.fetchall()
for x in result:
    print(x)

(100, 'Ram', 100, 100, 100, 100, 100, 100, 100.0, 'A+')
(301, 'Emran Khan', 97, 97, 97, 97, 97, 485, 97.0, 'A')
(200, 'Shyam', 99, 99, 99, 99, 99, 493, 99.98, 'A+')
(300, 'Hari', 98, 98, 98, 98, 98, 496, 98.0, 'A+')

In [18]:
db.execute("SELECT * FROM student ORDER BY total DESC")
result =db.fetchall()
for x in result:
    print(x)

(300, 'Hari', 98, 98, 98, 98, 98, 496, 98.0, 'A+')
(200, 'Shyam', 99, 99, 99, 99, 99, 493, 99.98, 'A+')
(301, 'Emran Khan', 97, 97, 97, 97, 97, 485, 97.0, 'A')
(100, 'Ram', 100, 100, 100, 100, 100, 100, 100.0, 'A+')

In [2]:
db.execute("SELECT * FROM student ORDER BY total DESC")
result =db.fetchall()
for x in result[3:11]:
    print(x)

(305, 'Ankita Dhital', 98, 99, 100, 96, 93, 486, 97.2, 'A')
(301, 'Emran Khan', 97, 97, 97, 97, 97, 485, 97.0, 'A')
(307, 'Zyan Malik', 90, 99, 100, 88, 70, 447, 89.4, 'A')
(303, 'Arambhav Paudel', 100, 76, 98, 88, 65, 427, 85.4, 'A')
(302, 'Amish Dhungana', 56, 89, 77, 87, 100, 409, 81.8, 'A')
(304, 'Sumit Bagdas', 0, 0, 33, 87, 34, 154, 30.8, 'NG')
(50, 'Pujya Ghimire', 101, 101, 101, 101, 101, 101, 100.0, 'A++')
(100, 'Ram Khatiwada', 100, 100, 100, 100, 100, 100, 100.0, 'A+')